

Процедура ПолучитьДанные(СтруктураОТборов,СтруктураДополнительныхПараметров,Ответ )  экспорт

	УстановитьПривилегированныйРежим(истина);
	////// пишем в лог
	
	 
		  МенеджерЗаписи 					= РегистрыСведений.extInt_Логирование.СоздатьМенеджерЗаписи();
		  МенеджерЗаписи.период				= ТекущаяДата();
		  МенеджерЗаписи.Сеанс			 	= 777;
		  МенеджерЗаписи.ВремяЗапуска		= строка(текущаяДата());
		  //МенеджерЗаписи.НастройкаОбмена	= ртПовторноеИспользованиеКэширумый.ПолучитьЗначениеПараметраИзСтруктурыКонстанты("ртНастройкиОповещений","ЗаказИнтернетМагазинБитрикс");
		  МенеджерЗаписи.Сообщение			= СтруктураДополнительныхПараметров.СтруктураЗапроса;
		 Попытка
		     МенеджерЗаписи.Записать();  	
		  
		 Исключение
			 ЗаписьЖурналаРегистрации( "extInt_", УровеньЖурналаРегистрации.Ошибка, ,ОписаниеОшибки() , ОписаниеОшибки());

		     сообщить(ОписаниеОшибки());
		 КонецПопытки;

	  
	    МассивОшибок = новый Массив;
	 	 
		
	    ЧтениеJSON = Новый ЧтениеJSON;
    	ЧтениеJSON.УстановитьСтроку(СтруктураДополнительныхПараметров.СтруктураЗапроса);
		
		попытка
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);

		исключение
		     ЗаписьЖурналаРегистрации( "extInt_", УровеньЖурналаРегистрации.Ошибка, ,ОписаниеОшибки() , ОписаниеОшибки());
			 МассивОшибок.Добавить(ОписаниеОшибки());
		 конецПопытки;

		
		
		ответТекст = "";
		структураОтвета = новый Структура("report, success, flag", "Обработка 1с", true , 1);
		
		ЗаписьJSON = новый ЗаписьJSON;
	  	ПараметрыЗаписи = новый ПараметрыЗаписиJSON(,Символы.Таб);
	  	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		
		попытка
	  		ЗаписатьJSON (ЗаписьJSON,структураОтвета);
	    	  
	 		ответТекст = записьJSON.Закрыть();
		исключение
		     ЗаписьЖурналаРегистрации( "extInt_", УровеньЖурналаРегистрации.Ошибка, ,"ответТекст" , ОписаниеОшибки());
			 МассивОшибок.Добавить(ОписаниеОшибки());	 
		 конецПопытки;
		 
		 /////////////
		ТекстОшибок = "";
		
		ЗаписьJSON = новый ЗаписьJSON;
	  	ПараметрыЗаписи = новый ПараметрыЗаписиJSON(,Символы.Таб);
	  	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		
		попытка
	  		ЗаписатьJSON (ЗаписьJSON,структураОтвета);
	    	  
	 		ТекстОшибок = записьJSON.Закрыть();
		исключение
		     ЗаписьЖурналаРегистрации( "extInt_", УровеньЖурналаРегистрации.Ошибка, ,"ТекстОшибок" , ОписаниеОшибки());
			 	 
		 конецПопытки;

		//////////////
		
		заголовкиОтвета = новый Структура();
		заголовкиОтвета.Вставить("Content_Type", "application/json");
		заголовкиОтвета.Вставить("Accept_Charset", "utf-8");
	
		Ответ.Вставить("Date",ТекущаяДата());
		Ответ.Вставить("Result",ответТекст);
		Ответ.Вставить("headers",заголовкиОтвета);
		Ответ.Вставить("descriptionErr",ТекстОшибок);
		
		
		
	УстановитьПривилегированныйРежим(ложь);
	
Конецпроцедуры	

