
Функция innerPOST(Запрос)
	
	   ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	  имяСобытия = "HTTPзапрос_getRelatedGood" ;
	
	 Попытка
		ответ =  extСлужебныйОбменыСерверВнешнееСоединение.ЗагрузитьСообщение(ТелоЗапроса,  имяСобытия);

	 	возврат  ответ;
	 Исключение
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(имяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ответ;
	КонецПопытки;

	
	
КонецФункции
